In [1]:
import numpy as np
import pandas as pd

# Basic Operations

In [3]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

### DataFrames Basic Operations

In [4]:
# Shape
df.shape

(5, 3)

In [5]:
# Columns
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [9]:
# Information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [ ]:
# some aggregate functions of table
df.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [ ]:
df['A'] + 10      # similarly more of the operations we studied in numpy

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

### DataFrames Applying Functions

In [20]:
# Squaring the values of 'B' column using function

def square(x):
    return x ** 2

df['B'] = df['B'].apply(square)
df

   A       B    C
0  1   100.0  100
1  2   400.0  200
2  3   900.0  300
3  4  1600.0  400
4  5  2500.0  500

In [21]:
# If we make new column
# Squaring the values of 'B' column using function

df['D'] = df['B'].apply(square)
df

   A       B    C          D
0  1   100.0  100    10000.0
1  2   400.0  200   160000.0
2  3   900.0  300   810000.0
3  4  1600.0  400  2560000.0
4  5  2500.0  500  6250000.0

In [22]:
# Using lambda function

df['D'] = df['A'].apply(lambda x: x ** 3)
df

   A       B    C    D
0  1   100.0  100    1
1  2   400.0  200    8
2  3   900.0  300   27
3  4  1600.0  400   64
4  5  2500.0  500  125